package com.example.DAO;

import com.example.Player.Player;

import java.util.List;

public interface PlayerDAO {

    /**
     * Η αναζήτηση ενός παίκτη με βάση το μοναδικού κωδικού του.
     * 
     * @param playerID Ο μοναδικός κωδικός του παίκτη.
     * @return Ο παίκτης ή {@code null} εάν αυτό δεν βρεθεί.
     */
    Player find(int playerID);

    /**
     * Αποθηκεύει ένα αντικείμενο στην εξωτερική πηγή
     * δεδομένων. Το αντικείμενο μπορεί να είναι κάποιο
     * νέο αντικείμενο που δεν υπάρχει στην πηγή δεδομένων
     * ή κάποιο το οποίο ήδη υπάρχει και ενημερώνεται η
     * κατάστασή του.
     * 
     * @param entity Το αντικείμενο του οποίου η κατάσταση
     *               αποθηκεύεται στην εξωτερική πηγή δεδομένων.
     */
    void save(Player entity);

    /**
     * Διαγράφει το αντικείμενο από την εξωτερική πηγή δεδομένων.
     * 
     * @param entity Το αντικείμενο προς διαγραφή.
     */
    void delete(Player entity);

    /**
     * Επιστρέφει όλα τα αντικείμενα από την εξωτερική πηγή δεδομένων.
     * 
     * @return Ο κατάλογος των αντικειμένων
     */
    List<Player> findAll();

}
